In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
dframe = pd.read_csv('lec25.csv')

In [5]:
dframe

   a   b   c   d    apple
0  2   3   4   5     pear
1  q   w   e   r   rabbit
2  5   2   4   5      dog

In [7]:
dframe = pd.read_csv('lec25.csv', header = None)

In [8]:
dframe

   0   1   2   3        4
0  a   b   c   d    apple
1  2   3   4   5     pear
2  q   w   e   r   rabbit
3  5   2   4   5      dog

In [9]:
dframe = pd.read_table('lec25.csv',sep=',',header=None)

In [11]:
dframe

   0   1   2   3        4
0  a   b   c   d    apple
1  2   3   4   5     pear
2  q   w   e   r   rabbit
3  5   2   4   5      dog

In [12]:
pd.read_csv('lec25.csv',header=None,nrows=2)

   0   1   2   3       4
0  a   b   c   d   apple
1  2   3   4   5    pear

In [13]:
dframe

   0   1   2   3        4
0  a   b   c   d    apple
1  2   3   4   5     pear
2  q   w   e   r   rabbit
3  5   2   4   5      dog

In [14]:
dframe.to_csv('mytextdata_out.csv')

In [15]:
import sys

In [16]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,a, b, c, d, apple
1,2, 3, 4, 5, pear
2,q, w, e, r, rabbit
3,5, 2, 4, 5, dog

In [18]:
dframe.to_csv(sys.stdout,sep='_')

_0_1_2_3_4
0_a_ b_ c_ d_ apple
1_2_ 3_ 4_ 5_ pear
2_q_ w_ e_ r_ rabbit
3_5_ 2_ 4_ 5_ dog

In [20]:
  dframe.to_csv(sys.stdout,sep='?')

?0?1?2?3?4
0?a? b? c? d? apple
1?2? 3? 4? 5? pear
2?q? w? e? r? rabbit
3?5? 2? 4? 5? dog

In [21]:
dframe.to_csv(sys.stdout,columns=[0,1,2]
             )

,0,1,2
0,a, b, c
1,2, 3, 4
2,q, w, e
3,5, 2, 4

In [22]:
url = 'https://docs.python.org/2/library/csv.html'